[
	{
		"name"		: "Stay Tv Series",
		"overview"	: "Stay is a TV drama series featuring Mkamzee Mwatela and produced by Jeremt Odiwour. ",
		"url"		: "Stay Tv Drama",
		"client"	: "Stay Tv Drama",
		"projScope"	: "MCB Studios was tasked with provision of sound services in the entire production of Stay ssn 2.Our team was tasked with the responsibility to assemble operate and do technical aspects of the show.Our vast experience in recording amplyfing ,wnhnacing mixing and reproducing sound came into play.We identified sound requirements for the show featuring award winning cast to appropriately perfom and produce KTN's smash tv series"
	},
	{
		"name"		: "DW Documentary",
		"overview"	: "Deuthwele (dw) is a German public international broadcaster featuring news,off-beat stories and anylis of German and ointernational affairs.",
		"url"		: "DW Documentary",
		"client"	: "DW TV",
		"projScope"	: "Working closly with other production staff ,MCB studios was briefed to shoot a news feature about climate change.MCB Studios oversaw the project from start to completion and licensed the content to DW Tv."
	},
	{
		"name"		: "Resolution Insurance",
		"overview"	: "Resolution Insurance is a leading Insurance firm in Kenya that takes its brand and visibility and visibility keenly.We are prud to have partenered with them in delivering this . ",
		"url"		: "Resolution Insurance",
		"client"	: "Resolution Insurance",
		"projScope"	: "MCB Studios was tasked with photography for the 15th Anniversary of Resolution Insurance and launch of their new line of insurance products.MCB Studios provided photography and videography for the event.A satisfied client resolution Insurance MD,Alice Mwai gave glowing remarks and a positive testimonial to the ongoing client relationship at the event."
	},
	{
		"name"		: "GIZ and WeltHunger Hilfe",
		"overview"	: "Short Film Production. ",
		"url"		: "GIZ and WeltHunger Hilfe",
		"client"	: "GIZ and WeltHunger Hilfe",
		"projScope"	: "MCB Studios was tasked with production of a documentary on a joint project for GIZ and WeltHunger Hilfe about their project concerning farming.MCB Studios conceptualised and led production to completion of the project also edited the project"
	}
]